# Oracle SQL Practice Notebook
This notebook provides a complete practice set for Oracle SQL, including user management, login, table creation, data insertion, and various SQL queries.

## 1. User and Session Setup
Creating and managing a user account (run as SYS/ADMIN).

In [ ]:
ALTER SESSION SET CONTAINER = XEPDB1;

In [ ]:
DROP USER user1 CASCADE;

In [ ]:
CREATE USER user1 IDENTIFIED BY user123;

In [ ]:
GRANT CREATE SESSION TO user1;

In [ ]:
ALTER USER user1 QUOTA UNLIMITED ON USERS;

In [ ]:
ALTER USER user1 ACCOUNT UNLOCK;

In [ ]:
GRANT CREATE TABLE TO user1;

In [ ]:
SELECT USERNAME, ACCOUNT_STATUS, COMMON FROM DBA_USERS WHERE USERNAME = 'user1';

## 2. Login as USER1
From a new SQL*Plus session, connect as:

In [ ]:
sqlplus user1/user123@localhost:1521/XEPDB1

In [ ]:
SET LINE 100;

In [ ]:
SET PAGESIZE 100;

## 3. Table Creation
Creating the EMP and DEPT tables under USER1.

In [ ]:
CREATE TABLE EMP (
    EMPNO     NUMBER(4)      PRIMARY KEY,
    ENAME     VARCHAR2(10)   NOT NULL,
    JOB       VARCHAR2(9)    NOT NULL,
    MGR       NUMBER(4),
    HIREDATE  DATE           NOT NULL,
    SAL       NUMBER(7,2)    CHECK (SAL > 0),
    COMM      NUMBER(7,2),
    DEPTNO    NUMBER(2),
    CONSTRAINT fk_deptno FOREIGN KEY (DEPTNO) REFERENCES DEPT(DEPTNO)
);

In [ ]:
DESC EMP;

In [ ]:
SELECT COUNT(*) FROM EMP;

In [ ]:
SELECT * FROM EMP;

In [ ]:
CREATE TABLE DEPT (
    DEPTNO   NUMBER(2)       PRIMARY KEY,
    DNAME    VARCHAR2(14)    NOT NULL,
    LOC      VARCHAR2(13) 
);

In [ ]:
DESC DEPT;

In [ ]:
SELECT COUNT(*) FROM DEPT;

In [ ]:
SELECT * FROM DEPT;

## 4. Data Insertion
Inserting sample data into EMP and DEPT tables.

In [ ]:
INSERT INTO EMP VALUES ('7369','SMITH','CLERK','7902','17-DEC-80','800.00',NULL,'20');

In [ ]:
INSERT INTO EMP VALUES ('7499','ALLEN','SALESMAN','7698','20-FEB-81','1600.00','300.00','30');

In [ ]:
INSERT INTO EMP VALUES ('7521','WARD','SALESMAN','7698','22-FEB-81','1250.00','500.00','30');

In [ ]:
INSERT INTO EMP VALUES ('7566','JONES','MANAGER','7839','02-APR-81','2975.00',NULL,'20');

In [ ]:
INSERT INTO EMP VALUES ('7654','MARTIN','SALESMAN','7698','28-SEP-81','1250.00','1400.00','30');

In [ ]:
INSERT INTO EMP VALUES ('7698','BLAKE','MANAGER','7839','01-MAY-81','2850.00',NULL,'30');

In [ ]:
INSERT INTO EMP VALUES ('7782','CLARK','MANAGER','7839','09-JUN-81','2450.00',NULL,'10');

In [ ]:
INSERT INTO EMP VALUES ('7788','SCOTT','ANALYST','7566','09-DEC-82','3000.00',NULL,'20');

In [ ]:
INSERT INTO EMP VALUES ('7839','KING','PRESIDENT',NULL,'17-NOV-81','5000.00',NULL,'10');

In [ ]:
INSERT INTO EMP VALUES ('7844','TURNER','SALESMAN','7698','08-SEP-81','1500.00','0.00','30');

In [ ]:
INSERT INTO EMP VALUES ('7876','ADAMS','CLERK','7788','12-JAN-83','1100.00',NULL,'20');

In [ ]:
INSERT INTO EMP VALUES ('7900','JAMES','CLERK','7698','03-DEC-81','950.00',NULL,'30');

In [ ]:
INSERT INTO EMP VALUES ('7902','FORD','ANALYST','7566','03-DEC-81','3000.00',NULL,'20');

In [ ]:
INSERT INTO EMP VALUES ('7934','MILLER','CLERK','7782','23-JAN-82','1300.00',NULL,'10');

In [ ]:
SELECT * FROM EMP;

In [ ]:
INSERT INTO DEPT VALUES ('10','ACCOUNTING','NEW YORK');

In [ ]:
INSERT INTO DEPT VALUES ('20','RESEARCH','DALLAS');

In [ ]:
INSERT INTO DEPT VALUES ('30','SALES','CHICAGO');

In [ ]:
INSERT INTO DEPT VALUES ('40','OPERATIONS','BOSTON');

In [ ]:
SELECT * FROM DEPT;

## 5. Basic Queries
Examples of WHERE, IN, LIKE, DISTINCT.

In [ ]:
SELECT ENAME, SAL, SAL * 12 AS ANNUAL_SALARY FROM EMP WHERE SAL * 12 > 30000;

In [ ]:
SELECT * FROM EMP WHERE JOB = 'SALESMAN' OR JOB = 'ANALYST';

In [ ]:
SELECT * FROM EMP WHERE JOB IN ('SALESMAN','ANALYST');

In [ ]:
SELECT * FROM EMP WHERE DEPTNO IN (10,20);

In [ ]:
SELECT * FROM EMP WHERE ENAME LIKE 'M%';

In [ ]:
SELECT * FROM EMP WHERE HIREDATE LIKE '%1981';

In [ ]:
SELECT DISTINCT JOB FROM EMP;

## 6. String Functions
Using string functions on EMP table.

In [ ]:
SELECT * FROM EMP WHERE SUBSTR(ENAME, 2, 2) = 'LA';

In [ ]:
SELECT JOB, REPLACE(JOB, 'SALESMAN', 'MARKETING') FROM EMP;

## 7. Date Functions
Using date functions on EMP table.

In [ ]:
SELECT * FROM EMP WHERE TO_CHAR(HIREDATE, 'DY') = 'THU';

In [ ]:
SELECT ENAME, ADD_MONTHS(HIREDATE, 6) AS REVIEW_DATE FROM EMP;

In [ ]:
SELECT ENAME, MONTHS_BETWEEN(SYSDATE, HIREDATE) AS MONTHS_WORKED FROM EMP;

## 8. Aggregate Functions
Examples of aggregate functions.

In [ ]:
SELECT SAL FROM EMP;

In [ ]:
SELECT MAX(SAL) FROM EMP;

In [ ]:
SELECT MIN(SAL) FROM EMP;

In [ ]:
SELECT SUM(SAL) FROM EMP;

In [ ]:
SELECT AVG(SAL) FROM EMP;

In [ ]:
SELECT COUNT(*) FROM EMP;

In [ ]:
SELECT COUNT(ENAME) FROM EMP;

In [ ]:
SELECT COUNT(DISTINCT(DEPTNO)) FROM EMP;

In [ ]:
SELECT DEPTNO, COUNT(*) FROM EMP GROUP BY DEPTNO;

In [ ]:
SELECT DEPTNO, MIN(SAL), MAX(SAL) FROM EMP GROUP BY DEPTNO;

In [ ]:
SELECT DEPTNO, JOB, SUM(SAL) FROM EMP GROUP BY DEPTNO, JOB;

In [ ]:
SELECT DEPTNO, SUM(SAL) FROM EMP GROUP BY DEPTNO;

In [ ]:
SELECT DEPTNO, COUNT(*) FROM EMP GROUP BY DEPTNO HAVING COUNT(*) > 3;

In [ ]:
SELECT DEPTNO, COUNT(*) FROM EMP GROUP BY DEPTNO HAVING COUNT(*) > 3 ORDER BY COUNT(*) ASC;